OMNIVUeTests/serviceTestData/EBcircuitCreation.xml


    <soapenv:Envelope xmlns:icl="http://www.ICLNBI.com/ICLNBI_V2.00.xsd" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <tns:CreateCircuitRequest xsi:schemaLocation="http://www.ICLNBI.com/ICLNBI_V2.00.xsd ICL_V2.01.xsd" xmlns:tns="http://www.ICLNBI.com/ICLNBI_V2.00.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <MessageElements>
            <MessageAddressing>
               <from>DSP</from>
               <to>ICL</to>
               <replyTo>DSP</replyTo>
               <messageID>msgid</messageID>
               <action>CreateCircuit</action>
               <timestamp>2008-09-29T07:19:45</timestamp>
               <transactionID>1234</transactionID>
               <serviceName>CreateCircuit</serviceName>
               <serviceVersion>3.0</serviceVersion>
               <userId/>
               <password/>
            </MessageAddressing>
         </MessageElements>
         <P2PCircuit xsi:type="tns:Point2PointCircuit">
            <commonName>EB/S7/SS/SUHA</commonName>
            <sourceSystem>ARM</sourceSystem>
            <ResourceType>NMI</ResourceType>
            <ResourceSubType/>
            <OwnsResourceDetails>
               <Customer>
                  <commonName>A002252</commonName>
               </Customer>
               <CustomerAgent>
                  <commonName/>
                  <RootEntityDescribedBy>
                     <characteristicName>FirstName</characteristicName>
                     <characteristicValue>ICL</characteristicValue>
                  </RootEntityDescribedBy>
                  <RootEntityDescribedBy>
                     <characteristicName>LastName</characteristicName>
                     <characteristicValue>AUTOMATION</characteristicValue>
                  </RootEntityDescribedBy>
                  <PartyRoleCategorizedUsing>
                     <categoryName/>
                  </PartyRoleCategorizedUsing>
                  <PartyRolePlays>
                     <involvementRole/>
                  </PartyRolePlays>
               </CustomerAgent>
            </OwnsResourceDetails>
            <bandwidth>200</bandwidth>
            <AEndTps>
               <commonName>Pluggable.2</commonName>
               <CLLICode/>
               <ResourceDescribedBy>
                  <CharacteristicName>ReservationID</CharacteristicName>
                  <CharacteristicValue/>
               </ResourceDescribedBy>
               <LogicalPhysicalResource>
                  <commonName/>
                  <PhysicalDevice>
                     <commonName>ETRPNVFH711-1234</commonName>
                  </PhysicalDevice>
               </LogicalPhysicalResource>
            </AEndTps>
            <ZEndTps>
               <commonName>Console.2</commonName>
               <CLLICode/>
               <ResourceDescribedBy>
                  <CharacteristicName>ReservationID</CharacteristicName>
                  <CharacteristicValue/>
               </ResourceDescribedBy>
               <LogicalPhysicalResource>
                  <commonName/>
                  <PhysicalDevice>
                     <commonName>ETRPNVFH722-1234</commonName>
                  </PhysicalDevice>
               </LogicalPhysicalResource>
            </ZEndTps>
         </P2PCircuit>
      </tns:CreateCircuitRequest>
   </soapenv:Body>
</soapenv:Envelope>
